In [101]:
import pandas as pd 
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [102]:
df = pd.read_csv('titanic.csv')
df.head(2)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1

In [103]:
df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket','Cabin' ,'Embarked'], axis= 'columns', inplace= True)

In [104]:
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [105]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [106]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [107]:
inputs= pd.concat([inputs, dummies], axis = 'columns')
inputs

     Pclass     Sex   Age     Fare  female  male
0         3    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         3  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         3    male  35.0   8.0500       0     1
..      ...     ...   ...      ...     ...   ...
886       2    male  27.0  13.0000       0     1
887       1  female  19.0  30.0000       1     0
888       3  female   NaN  23.4500       1     0
889       1    male  26.0  30.0000       0     1
890       3    male  32.0   7.7500       0     1

[891 rows x 6 columns]

In [108]:
inputs.drop(['Sex'] , axis = "columns", inplace= True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [109]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [110]:
inputs.Age[:20]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     NaN
18    31.0
19     NaN
Name: Age, dtype: float64

In [111]:
inputs.Age= inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [112]:
X_train,X_test,y_train,y_test= train_test_split(inputs, target, test_size=0.20)

In [113]:
model = GaussianNB().fit(X_train, y_train)
model.score(X_test, y_test)

0.8100558659217877

In [114]:
y_test[:10]

C:\Users\HP\AppData\Local\Temp\ipykernel_14804\2588316582.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  y_test[:10]

364    0
529    0
263    0
397    0
174    0
106    1
755    1
480    0
341    1
589    0
Name: Survived, dtype: int64

In [116]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 1, 0, 0, 1, 0], dtype=int64)

In [117]:
model.predict_proba(X_test[:10])

array([[9.88211538e-01, 1.17884620e-02],
       [9.71887665e-01, 2.81123351e-02],
       [9.05775960e-01, 9.42240397e-02],
       [9.71666674e-01, 2.83333260e-02],
       [8.71576089e-01, 1.28423911e-01],
       [6.66784607e-02, 9.33321539e-01],
       [9.37878777e-01, 6.21212226e-02],
       [9.70782044e-01, 2.92179558e-02],
       [3.32706501e-12, 1.00000000e+00],
       [9.88136426e-01, 1.18635738e-02]])